package com.hc.android_demo.fragment.content;

import android.annotation.SuppressLint;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;

import com.hc.android_demo.R;

public class CustomNestedScrollViewFragment extends Fragment {
    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        return inflater.inflate(R.layout.fragment_custom_nested_scroll_view, container, false);
    }

    @SuppressLint("SetTextI18n")
    @Override
    public void onViewCreated(@NonNull View view, @Nullable Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
        TextView textView = view.findViewById(R.id.textView);
        textView.setText("打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" +
                "打分卡丽娜第三方发打发斯蒂芬大师傅打法萨芬撒到主线程那就看呗请叫我考核人几哈接口或会计证程序" );
    }
}
